[
  {
    "term": "dispensations of the covenant of grace",
    "explanation": "This phrase refers to periods or systems within religious history believed to involve God's governance and relationship with humanity under a particular divine agreement.",
    "modern_equivalent": "phases of a divine agreement"
  },
  {
    "term": "patriarchal institution",
    "explanation": "This refers to the social and religious system existing during the time of the biblical patriarchs, such as Abraham, Isaac, and Jacob.",
    "modern_equivalent": "ancient religious tradition"
  },
  {
    "term": "Reign of Heaven",
    "explanation": "An era or condition characterized by divine rule or the influence of God's kingdom as understood in a Christian theological context.",
    "modern_equivalent": "Kingdom of God"
  },
  {
    "term": "King of the Jews",
    "explanation": "A title referring to God's role as the sovereign over the nation of Israel in biblical times.",
    "modern_equivalent": null
  },
  {
    "term": "High Priest",
    "explanation": "The chief religious leader in Jewish tradition, particularly prominent in temple worship.",
    "modern_equivalent": "chief priest"
  },
  {
    "term": "national altar",
    "explanation": "A central place for religious sacrifice and offerings within the Jewish nation.",
    "modern_equivalent": "primary altar"
  },
  {
    "term": "convocations",
    "explanation": "Formal gatherings or assemblies for religious purposes.",
    "modern_equivalent": "assemblies"
  },
  {
    "term": "peculiar treasure",
    "explanation": "This phrase denotes a special or unique status as God's chosen people, used to describe Israel.",
    "modern_equivalent": "special possession"
  },
  {
    "term": "Zion",
    "explanation": "A biblical term for the city of Jerusalem, particularly in its aspect as a spiritual symbol of God's presence and the people of Israel.",
    "modern_equivalent": "Jerusalem"
  },
  {
    "term": "Mount Zion",
    "explanation": "A hill in Jerusalem that holds significant religious symbolism in Judaism and Christianity.",
    "modern_equivalent": null
  },
  {
    "term": "book of God",
    "explanation": "Refers to the divine record or register of those belonging to God, analogous to the 'Book of Life' in Christian theology.",
    "modern_equivalent": "divine record"
  }
]